package com.GrowMyJava.Algorithmization.SortedArray;

public class Task_5 {

    //from forum:
    // Вопрос: Добрый вечер! Модуль 2, сортировки, задача 5 - сортировка вставками. Не совсем понятно условие.
    // Нам изначально даны числа в порядке возрастания? Или до i-го элемента возрастает, а далее в случайном порядке?
    // И двоичный поиск элемента, он ведь будет работать только в отсортированной последовательности, а наша последовательность
    // не отсортирована!
    //Ответ: читайте внимательно задачу. дана последовательность с n элементами. она не упорядочена. А вот ее подпоследовательность
    // до i-го элемента - упорядочена (в неупорядоченной последовательности есть ряж элементов, которые упорядочены).
    // Вставить оставшиеся элементы, чтобы не нарушить порядок - дело техники.
}
